src/posts/2015-07-13-ip.ericb.me.org
#+OPTIONS: toc:nil
#+BEGIN_HTML
---
title:  "ip.ericb.me"
author: Eric Bailey
tags: hack, clojure, web-service, open-source
---
#+END_HTML

As a follow-up to [[http://blorg.ericb.me/2014/12/icanhazip.com][my previous post about icanhazip.com]], I figured it bears
mentioning I've since set up [[https://github.com/yurrriq/what-is-my-ip][my own IP echo service]] and am running it at
[[http://ip.ericb.me][ip.ericb.me]].


Its excruciatingly simple Clojure source looks something like this:

#+BEGIN_SRC clojure
(defroutes app
  (GET "/" {{x-real-ip "x-real-ip"} :headers}
    {:status  200
     :headers {"Content-Type" "text/plain"}
     :body    x-real-ip}))

(defn -main [& args]
  (->> (or (some-> (env :port) (Integer/parseInt)) 5000)
       (hash-map :port)
       (run-server app)))
#+END_SRC
