_posts/2015-07-13-ip.ericb.me.html
---
layout: post
title:  "ip.ericb.me"
date:   Mon 2015-07-13 20:33:00 CDT 2015
---

<p>
As a follow-up to <a href="http://blorg.ericb.me/2014/12/icanhazip.com">my previous post about icanhazip.com</a>, I figured it bears
mentioning I've since set up <a href="https://github.com/yurrriq/what-is-my-ip">my own IP echo service</a> and am running it at
<a href="http://ip.ericb.me">ip.ericb.me</a>.
</p>


<p>
Its excruciatingly simple Clojure source looks something like this:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #A1EFE4;">(</span><span style="color: #F92672;">defroutes</span> <span style="color: #A6E22E;">app</span>
  <span style="color: #E6DB74;">(</span><span style="color: #AE81FF;">GET</span> <span style="color: #E6DB74;">"/"</span> <span style="color: #66D9EF;">{</span><span style="color: #FD971F;">{</span>x-real-ip <span style="color: #E6DB74;">"x-real-ip"</span><span style="color: #FD971F;">}</span> <span style="color: #AE81FF;">:headers</span><span style="color: #66D9EF;">}</span>
    <span style="color: #66D9EF;">{</span><span style="color: #AE81FF;">:status</span>  200
     <span style="color: #AE81FF;">:headers</span> <span style="color: #FD971F;">{</span><span style="color: #E6DB74;">"Content-Type"</span> <span style="color: #E6DB74;">"text/plain"</span><span style="color: #FD971F;">}</span>
     <span style="color: #AE81FF;">:body</span>    x-real-ip<span style="color: #66D9EF;">}</span><span style="color: #E6DB74;">)</span><span style="color: #A1EFE4;">)</span>

<span style="color: #A1EFE4;">(</span><span style="color: #F92672;">defn</span> <span style="color: #A6E22E;">-main</span> <span style="color: #E6DB74;">[</span>&amp; args<span style="color: #E6DB74;">]</span>
  <span style="color: #E6DB74;">(</span><span style="color: #F92672;">-&gt;&gt;</span> <span style="color: #66D9EF;">(</span><span style="color: #F92672;">or</span> <span style="color: #FD971F;">(</span>some-&gt; <span style="color: #A6E22E;">(</span>env <span style="color: #AE81FF;">:port</span><span style="color: #A6E22E;">)</span> <span style="color: #A6E22E;">(</span><span style="color: #66D9EF;">Integer</span>/<span style="color: #F92672;">parseInt</span><span style="color: #A6E22E;">)</span><span style="color: #FD971F;">)</span> 5000<span style="color: #66D9EF;">)</span>
       <span style="color: #66D9EF;">(</span>hash-map <span style="color: #AE81FF;">:port</span><span style="color: #66D9EF;">)</span>
       <span style="color: #66D9EF;">(</span>run-server app<span style="color: #66D9EF;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A1EFE4;">)</span>
</pre>
</div>
